Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: Git compresses the contents of these files with zlib, and you’re not storing much, so all these files collectively take up only 925 bytes.
cs: Git komprimuje obsah těchto souborů metodou zlib a uložená data tak nejsou příliš velká. Všechny tyto soubory zabírají dohromady pouhých 925 bytů.

source: Git compresses the new content with zlib, which you can do in Ruby with the zlib library.
cs: Git zkomprimuje nový obsah metodou zlib, která je obsažena v knihovně zlib.

source: Git concatenates the header and the original content and then calculates the SHA-1 checksum of that new content.
cs: Git vytvoří řetězec ze záhlaví a původního obsahu a vypočítá kontrolní součet SHA-1 tohoto nového obsahu.

source: Git constructs a header that starts with the type of the object, in this case a blob.
cs: Git vytvoří záhlaví, které bude začínat typem objektu, jímž je v našem případě blob.

source: Git directory objects with branch head references included.
cs: Objekty v adresáři Git s referencemi větve „head“

source: Git does not provide such a `stash unapply` command, but it is possible to achieve the effect by simply retrieving the patch associated with a stash and applying it in reverse:
cs: Git nenabízí žádný příkaz ve smyslu `stash unapply`, ovšem je možné použít reverzní aplikaci patche reprezentujícího odklad:

source: Git does this if you have too many loose objects around, if you run the `git gc` command manually, or if you push to a remote server.
cs: Git k tomuto kroku přistoupí, pokud máte příliš mnoho volných objektů, pokud ručně spustíte příkaz `git gc` nebo jestliže odesíláte revize na vzdálený server.

source: Git doesn’t have a modify-history tool, but you can use the rebase tool to rebase a series of commits onto the HEAD they were originally based on instead of moving them to another one.
cs: Git nemá zvláštní nástroj k úpravě historie, ale můžete využít nástroje přeskládání, jímž přeskládáte sérii revizí na revizi HEAD, na níž se původně zakládaly. Revize není třeba přesouvat jinam.

source: Git doesn’t infer your command if you type it in partially.
cs: Jestliže zadáte systému Git neúplný příkaz, systém si ho nedoplní.

source: Git doesn’t think of or store its data this way.
cs: Git zpracovává data jinak.

source: Git figured out that about 12 commits came between the commit you marked as the last good commit (v1.0) and the current bad version, and it checked out the middle one for you.
cs: Git zjistil, že mezi revizí, kterou jste označili jako poslední dobrou (v1.0), a aktuální problémovou verzí je asi 12 revizí, a provedl checkout prostřední revize.

source: Git figures out that it’s a rename implicitly, so it doesn’t matter if you rename a file that way or with the `mv` command.
cs: Git implicitně zjistí, že se jedná o přejmenování, a proto nehraje roli, zda přejmenujete soubor tímto způsobem, nebo pomocí příkazu `mv`.

source: Git figures out what branch your dcommits go to by looking for the tip of any of your Subversion branches in your history — you should have only one, and it should be the last one with a `git-svn-id` in your current branch history.
cs: Git zjistí, do jaké větve se vaše revize zapsané příkazem dcommit dostanou – podívá se na konec všech větví Subversion ve vaší historii. Měli byste mít pouze jednu a měla by to být poslední větev s `git-svn-id` ve vaší aktuální historii větve.

source: Git fires up the `send-pack` process, which initiates a connection over SSH to your server.
cs: Git spustí proces `send-pack`, který iniciuje spojení se serverem přes SSH.

source: Git gives you the name of the nearest tag with the number of commits on top of that tag and a partial SHA-1 value of the commit you’re describing:
cs: Git vám poskytne název nejbližší značky s počtem revizí na vrcholu této značky a část hodnoty SHA-1 revize, k níž se popis vztahuje:

source: Git has a few configuration options to help with these issues.
cs: Git disponuje několika konfiguračními parametry, které vám pomohou tyto problémy vyřešit.

source: Git has a number of different transfer protocols you can use.
cs: Git nabízí celou řadu různých přenosových protokolů.

source: Git has initialized the `objects` directory and created `pack` and `info` subdirectories in it, but there are no regular files.
cs: Git inicializoval adresář `objects` a vytvořil v něm podadresáře `pack` a `info`, nenajdeme tu však žádné skutečné soubory.

source: Git has three main states that your files can reside in: committed, modified, and staged.
cs: Git používá pro spravované soubory tři základní stavy: zapsáno (committed), změněno (modified) a připraveno k zapsání (staged).

source: Git hasn’t automatically created a new merge commit.
cs: Git nepřistoupil k automatickému vytvoření nové revize sloučením.

source: Git is a content-addressable filesystem.
cs: Git je obsahově adresovatelný systém souborů.

source: Git is smart enough to figure out what commit you meant to type if you provide the first few characters, as long as your partial SHA-1 is at least four characters long and unambiguous — that is, only one object in the current repository begins with that partial SHA-1.
cs: Git je dostatečně chytrý na to, aby pochopil, jakou revizi jste měli na mysli, zadáte-li pouze prvních několik znaků. Tento neúplný otisk SHA-1 musí mít alespoň čtyři znaky a musí být jednoznačný, tj. žádný další objekt v aktuálním repozitáři nesmí začínat stejnou zkrácenou hodnotou SHA-1.

source: Git lets you put the string `$Format:$` in any file with any of the `--pretty=format` formatting shortcodes, many of which you saw in Chapter 2.
cs: Git umožňuje vložit řetězec `$Format:$` do libovolného souboru s kterýmkoli ze zkrácených kódů formátování `--pretty=format`, z nichž jsme několik poznali v kapitole 2.

source: Git moves them around as bookmarks to the last known state of where those branches were on those servers.
cs: Git je přemisťuje jako záložky poslední známé pozice těchto větví na serveru.

source: Git normally creates a tree by taking the state of your staging area or index and writing a tree object from it.
cs: Git běžně vytváří strom tak, že vezme stav oblasti připravených změn nebo-li indexu a zapíše z nich objekt stromu.

source: Git object data for multiple commits.
cs: Data objektů Git pro několik revizí

source: Git operates slightly differently if you explicitly specify `file://` at the beginning of the URL.
cs: Pokud na začátek URL explicitně zadáte výraz `file://`, pracuje Git trochu jinak.

source: Git provides a safer command to do this if you want to update a reference called `update-ref`:
cs: Git zná bezpečnější metodu, jak referenci aktualizovat: příkaz `update-ref`:

source: Git provides an easy way to check for this — before you commit, run `git diff --check`, which identifies possible whitespace errors and lists them for you.
cs: Git nabízí snadný způsob, jak tyto chyby zkontrolovat. Před zapsáním revize zadejte příkaz `git diff --check`, který zkontroluje prázdné znaky a vypíše vám jejich seznam.

source: Git sends a line for each reference you’re updating with the old SHA, the new SHA, and the reference that is being updated.
cs: Git odešle jeden řádek pro každou referenci, kterou aktualizujete. Řádek obsahuje starou hodnotu SHA, novou hodnotu SHA a referenci, která je aktualizována.

source: Git stores and thinks about information much differently than these other systems, even though the user interface is fairly similar; understanding those differences will help prevent you from becoming confused while using it.
cs: Ačkoli je uživatelské rozhraní velmi podobné, Git ukládá a zpracovává informace poněkud odlišně od ostatních systémů. Pochopení těchto rozdílů vám pomůže předejít nejasnostem, které mohou při používání systému Git vzniknout.

source: Git stores content in a manner similar to a UNIX filesystem, but a bit simplified.
cs: Git ukládá obsah podobným způsobem jako systém souborů UNIX, jen trochu jednodušeji.

source: Git stores data as snapshots of the project over time.
cs: Git ukládá data jako snímky projektu proměnlivé v čase.

source: Git successfully and succinctly tells me that I added the string "(See Chapter 3)", which is correct.
cs: Git mi stroze, ale pravdivě sděluje, že jsem přidal řetězec „(See Chapter 3)“, což je správné.

source: Git tells you the original commit where you wrote those lines, even if it was in another file.
cs: Git vám vyhledá původní revizi, kde jste tyto řádky napsali, dokonce i když jsou v jiném souboru.

source: Git then creates a `commit` object that has the metadata and a pointer to the root project `tree` object so it can re-create that snapshot when needed.
cs: Poté vytvoří objekt revize s metadaty a ukazatelem na kořenový strom projektu, aby mohl v případě potřeby tento snímek obnovit.

source: Git thinks about its data more like Figure 1-5.
cs: Zpracování dat v systému Git ilustruje obrázek 1-5.

source: Git transport over HTTP is often referred to as the dumb protocol because it requires no Git-specific code on the server side during the transport process.
cs: V souvislosti s přenosem dat systému Git prostřednictvím HTTP se často mluví o hloupém protokolu (dumb protocol), protože během přenosu nevyžaduje na straně serveru žádný specifický kód Git.

source: Git uses a series of configuration files to determine non-default behavior that you may want.
cs: Git používá sérii konfiguračních souborů, v nichž lze nastavit odlišnosti od výchozí konfigurace.

source: Git uses two main types of tags: lightweight and annotated.
cs: Git používá dva hlavní druhy značek: prosté (lightweight) a anotované (annotated).

source: Git will also automatically remove commits that did not affect the subdirectory.
cs: Git také automaticky odstraní revize, které nemají na podadresář žádný vliv.

source: Git will ask you which files you would like to partially stage; then, for each section of the selected files, it will display hunks of the file diff and ask if you would like to stage them, one by one:
cs: Git se vás zeptá, které soubory chcete částečně připravit. Pro každou část vybraných souborů pak zobrazí komplexy (hunks) rozdílů diff daného souboru a u každého z nich se vás zeptá, jestli si ho přejete připravit k zapsání:

source: Git will automatically add group write permissions to a repository properly if you run the `git init` command with the `--shared` option.
cs: Zadáte-li příkaz `git init` s parametrem `--shared`, Git automaticky nastaví příslušná oprávnění skupiny k zápisu.

source: Git will detect these issues when you run a `git diff` command and try to color them so you can possibly fix them before you commit.
cs: Až spustíte příkaz `git diff`, Git se pokusí tyto problémy vyhledat a barevně označit, abyste je mohli případně ještě před zapsáním revize opravit.

source: Git will move them for the sake of efficiency into a file named `.git/packed-refs` that looks like this:
cs: Git je pro zvýšení účinnosti přesune do souboru `.git/packed-refs`, jenž má následující podobu:

source: Git will occasionally repack your database automatically, always trying to save more space.
cs: Git čas od času „přebalí“ celou vaši databázi automaticky a pokusí se tím ušetřit další místo.

source: Git will then record each snapshot appropriately:
cs: Git pak odpovídajícím způsobem nahraje všechny snímky:

source: GitHub administration page.
cs: Stránka správy na serveru GitHub

source: GitHub is also a commercial company that charges for accounts that maintain private repositories, but anyone can quickly get a free account to host as many open source projects as they want.
cs: GitHub je zároveň komerční společnost, jejíž finanční příjmy plynou z účtů spravujících soukromé repozitáře. Kdokoli si však může rychle založit bezplatný účet k hostování libovolného počtu projektů s otevřeným kódem.

source: GitHub is by far the largest open source Git hosting site and it’s also one of the very few that offers both public and private hosting options so you can keep your open source and private commercial code in the same place.
cs: GitHub je zdaleka největším hostingovým místem pro projekty Git s otevřeným zdrojovým kódem a je zároveň jedním z velmi mála těch, která nabízejí možnosti jak veřejného, tak soukromého hostingu. Na jednom místě tak můžete mít uložen jak otevřený zdrojový kód, tak soukromý komerční kód.

source: GitHub is slightly different than most code-hosting sites in the way that it namespaces projects.
cs: GitHub se nepatrně liší od většiny míst hostujících zdrojový kód ve způsobu, jak zachází se jmenným prostorem projektů.

source: GitHub project header information.
cs: Záhlaví s informacemi o projektu na serveru GitHub

source: Gitk is basically a visual `git log` tool, and it accepts nearly all the filtering options that `git log` does.
cs: Gitk je v zásadě grafická verze příkazu `git log` a umožňuje téměř všechny možnosti filtrování jako `git log`.

source: Gitolite allows you to specify permissions not just by repository, but also by branch or tag names within each repository.
cs: Gitolite umožňuje nastavit přístupová práva nejen na repozitáře (podobně jako Gitosis), ale také na větve a značky v každém repozitáři.

source: Gitolite allows you to specify repositories with wildcards (actually Perl regexes), like, for example `assignments/s[0-9][0-9]/a[0-9][0-9]`, to pick a random example.
cs: Gitolite vám umožní určit repozitáře zástupnými znaky (wildcards; ve skutečnosti jde o perlovské regulární výrazy) -- jako například u náhodně vybraného příkladu `assignments/s[0-9][0-9]/a[0-9][0-9]`.

source: Gitolite also has a feature called "personal branches" (or rather, "personal branch namespace") that can be very useful in a corporate environment.
cs: Konečně Gitolite má také funkci, která se nazývá „osobní větve“ (nebo raději „jmenný prostor osobních větví“) a může být velmi užitečná v korporátním prostředí.

source: Gitolite has now been installed on the server, and you now have a brand new repository called `gitolite-admin` in your workstation.
cs: Nyní máte Gitolite nainstalovaný na serveru a v domácím adresáři vaší pracovní stanice máte také úplně nový repozitář `gitolite-admin`.

source: Gitolite is an authorization layer on top of Git, relying on `sshd` or `httpd` for authentication.
cs: Gitolite je autorizační vrstva nad gitem, která při autentizaci spoléhá na `sshd` nebo `httpd`.

source: Gitolite is somewhat unusual as far as "server" software goes — access is via SSH, and so every userid on the server is a potential "gitolite host".
cs: Nástroj Gitolite je ve smyslu „serverového“ softwaru poněkud neobvyklý. Přístup se realizuje přes SSH, takže každá serverová userid je potenciálně „hostitelem gitolite“ (gitolite host).

source: Gitolite lets you define a "personal" or "scratch" namespace prefix for each developer (for example, `refs/personal/<devname>/*`); please see the documentation for details.
cs: Gitolite vám umožní nadefinovat pro každého vývojáře jmenné prostory s prefixy „personal“ nebo „scratch“ (např. `refs/personal/<devname>/*`). Podrobnosti hledejte v dokumentaci.

source: Gitolite shows you what repos you have access to, and what that access may be.
cs: Gitolite vám ukáže, ke kterým repozitářům máte přístup a s jakými oprávněními.

source: Gitosis can also control which projects GitWeb shows.
cs: Gitosis může také určovat, jaké projekty bude zobrazovat GitWeb.

source: Gitosis has simple access controls as well.
cs: Gitosis nabízí také jednoduchou správu přístupu.

source: Gitosis is basically a set of scripts that help you manage the `authorized_keys` file as well as implement some simple access controls.
cs: Gitosis je v podstatě sada skriptů usnadňující správu souboru `authorized_keys` a implementaci jednoduché správy přístupu.

source: Gitosis is going to manage your keys for you, so you need to remove the current file, re-add the keys later, and let Gitosis control the `authorized_keys` file automatically.
cs: Gitosis teď bude spravovat klíče za vás. Proto je třeba, abyste odstranili aktuální soubor, klíče znovu přidali později a nechali Gitosis automaticky spravovat soubor `authorized_keys`.

source: Gitosis requires some Python tools, so first you have to install the Python setuptools package, which Ubuntu provides as python-setuptools:
cs: Gitosis vyžaduje některé nástroje v jazyce Python, a proto první, co musíte udělat, je nainstalovat pythonovský balíček setuptools, který je v Ubuntu dostupný jako python-setuptools:

source: Glob patterns are like simplified regular expressions that shells use.
cs: Masky souborů jsou jako zjednodušené regulární výrazy, které používá shell.

source: Grab the tree object:
cs: Načtěte objekt stromu:

source: Great.
cs: Výborně.

source: HEAD file pointing to the branch you’re on.
cs: Soubor HEAD ukazující na větev, na níž se nacházíte.

source: HEAD moves to another branch on a checkout.
cs: Ukazatel HEAD se po příkazu git checkout přesune na jinou větev.

source: HEAD points to another branch when you switch branches.
cs: Soubor HEAD ukazuje po přepnutí na jinou větev.

source: Having a good guideline for creating commits and sticking to it makes working with Git and collaborating with others a lot easier.
cs: Není od věci stanovit si a dodržovat kvalitní pravidla pro vytváření revizí. Výrazně vám mohou usnadnit práci v systému Git a spolupráci s kolegy.

source: Having their carefully crafted work rejected at the last minute can be extremely frustrating and confusing; and furthermore, they will have to edit their history to correct it, which isn’t always for the faint of heart.
cs: Odmítnete-li na poslední chvíli práci, na níž si dávali záležet, budou vaši uživatelé zmatení a otrávení, nemluvě o tom, že budou muset kvůli opravě měnit svou historii, což může bázlivější povahy odradit.

source: Having work themes isolated into topic branches also makes it easier for you to rebase your work if the tip of the main repository has moved in the meantime and your commits no longer apply cleanly.
cs: Jednotlivé úkoly izolované v tematických větvích mají také tu výhodu, že snáze přeskládáte svou práci, jestliže se průběžně posouvá konec hlavního repozitáře a vaše revize už nelze aplikovat čistě.

source: Here I assume the connecting user is in the `$USER` environment variable, so your update script begins by gathering all the information you need:
cs: V tomto okamžiku předpokládám, že je připojující se uživatel v proměnné prostředí `$USER`, a skript update tak začne shromažďovat všechny potřebné informace:

source: Here are a couple of examples you may want to set up:
cs: Uveďme několik příkladů možného nastavení:

source: Here are a few commands that give you what Subversion used to.
cs: Na tomto místě proto uvedu pár příkazů, které jsou podobné jako v systému Subversion.

source: Here are all the objects in the example directory now, commented with what they store:
cs: Toto jsou všechny objekty v ukázkovém adresáři spolu s komentářem k tomu co obsahují:

source: Here is a method that gives you an associative array where the key is the user name and the value is an array of paths to which the user has write access:
cs: Používá se tu metoda asociativních polí, kdy klíč představuje jméno uživatele a hodnotu tvoří sada umístění, k nimž má uživatel oprávnění pro zápis:

source: Here is a small Ruby script that does that:
cs: Tady je malý Ruby skript, který to umí:

source: Here is an example `.gitignore` file:
cs: Tady je malý příklad souboru `.gitignore`:

source: Here is an example of adding your server as a remote:
cs: Tady je příklad, jak můžete váš server přidat jako vzdálený:

source: Here is an example pre-rebase script that checks for that.
cs: Jako příklad uvedeme skript pre-rebase, který bude toto pravidlo kontrolovat.

source: Here is an example, where I’ve replaced a red terminal color with `X`s:
cs: Zde uvádím jeden příklad, v němž jsem červenou barvu terminálu nahradil znaky `X`:

source: Here is an example:
cs: Tady máme příklad:

source: Here is another example `.gitignore` file:
cs: Tady je další příklad souboru `.gitignore`:

source: Here is example to experiment with
cs: Můžete vyzkoušet

source: Here we can see the two commits that we have had checked out, however there is not much information here.
cs: Vidíme tu obě revize, jichž jsme se zbavili, ale není tu k nim mnoho informací.

source: Here we’ll discuss what they are and in what basic circumstances you would want (or not want) to use them.
cs: V této části se podíváme na to, co jsou jednotlivé protokoly zač a za jakých okolností je (ne)vhodné je použít.

source: Here you can do a number of things, including staging files, unstaging files, staging parts of files, adding untracked files, and seeing diffs of what has been staged.
cs: Tady můžete provádět celou řadu věcí, včetně přípravy souborů k zapsání, vracení připravených souborů, přípravy částí souborů, přidávání nesledovaných souborů a prohlížení změn v připravených souborech.

source: Here you can run `rev-parse` on your branch.
cs: Tehdy můžete na svou větev spustit příkaz `rev-parse`:

source: Here you must choose a username that isn’t yet taken in the system and enter an e-mail address that will be associated with the account and a password (see Figure 4-3).
cs: Tady si budete muset zvolit uživatelské jméno, které zatím není v systému obsazeno, a zadat e-mailovou adresu, která bude přiřazena k účtu a heslu (viz obrázek 4-3).

source: Here you’ll clone a project with a submodule in it.
cs: Nyní naklonujeme projekt, jehož součástí je submodul.

source: Here you’ll configure Git to use the `catdoc` program, which was written specifically for extracting text from a binary MS Word documents (you can get it from `http://www.wagner.pp.ru/~vitus/software/catdoc/`), to convert Word documents into readable text files, which it will then diff properly:
cs: V našem případě nastavíme Git tak, aby ke konverzi dokumentů Word do čitelných textových souborů, způsobilých ke zpracování nástrojem diff, používal program `catdoc`, který byl napsán přímo pro extrakci textu z binární podoby dokumentů MS Word (můžete jej získat z `http://www.wagner.pp.ru/~vitus/software/catdoc/`). Tím wordovské dokumenty převedeme na čitelné textové soubory, na které lze úspěšně aplikovat algoritmus pro zjišťování rozdílů (diff):

source: Here you’ll see how to do the same rack embedding as in the last section, but using subtree merges instead.
cs: Ukažme si, jak se dá začlenit stejný adresář rack jako v předchozí části, tentokrát však s využitím strategie začlenění podstromu.

source: Here you’ll use a format very much like the CVS ACL mechanism: it uses a series of lines, where the first field is `avail` or `unavail`, the next field is a comma-delimited list of the users to which the rule applies, and the last field is the path to which the rule applies (blank meaning open access).
cs: Tady budete používat formát velmi podobný mechanismu CVS ACL. Využívá posloupnosti řádků, kdy v prvním poli stojí `avail` nebo `unavail`, v dalším poli je čárkami oddělený seznam uživatelů, jichž se pravidlo týká, a v posledním poli je uvedeno umístění, na něž se pravidlo vztahuje (prázdné pole označuje otevřený přístup).

source: Here, 644 is the mode (if you have executable files, you need to detect and specify 755 instead), and inline says you’ll list the contents immediately after this line.
cs: 644 je v tomto případě režim (jde-li o spustitelné soubory, budete je muset vyhledat a zadat režim 755) a výraz inline říká, že obsah uvedete bezprostředně po tomto řádku.

source: Here, the `9bc1d` blob, which if you remember was the first version of your repo.rb file, is referencing the `05408` blob, which was the second version of the file.
cs: Blob `9bc1d`, který, jak si možná vzpomínáte, byl první verzí souboru repo.rb, odkazuje na blob `05408`, který byl druhou verzí tohoto souboru.
